
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Golang进阶 · 面试笔记</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="胡伟煌">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-okaidia.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../k8s/k8s-basic.html" />
    
    
    <link rel="prev" href="golang-basic.html" />
    

    
        <link rel="shortcut icon" href='../images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../images/favicon.ico' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='../images/favicon.ico'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="../images/favicon.ico">
        
        <link rel="apple-touch-icon" sizes="180x180" href="../images/favicon.ico">
        
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"huweihuang/interview-notes","types":["star"],"size":"small"};
    </script>


        <!-- https://www.google.com/adsense -->
        
        <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-8205636531078391" crossorigin="anonymous"></script>
        
    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.huweihuang.com" target="_blank" class="custom-link">胡伟煌的博客</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">目录</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    序言
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Linux基础</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../linux/linux.html">
            
                <a href="../linux/linux.html">
            
                    
                        <b>2.1.</b>
                    
                    Linux基础
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">数据结构</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../data-structure/data-structure.html">
            
                <a href="../data-structure/data-structure.html">
            
                    
                        <b>3.1.</b>
                    
                    数据结构基础
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">TCP/IP</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../tcpip/tcpip.html">
            
                <a href="../tcpip/tcpip.html">
            
                    
                        <b>4.1.</b>
                    
                    TCP/IP基础
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Golang</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="golang-basic.html">
            
                <a href="golang-basic.html">
            
                    
                        <b>5.1.</b>
                    
                    Golang基础
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="5.2" data-path="golang-advanced.html">
            
                <a href="golang-advanced.html">
            
                    
                        <b>5.2.</b>
                    
                    Golang进阶
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Kubernetes</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../k8s/k8s-basic.html">
            
                <a href="../k8s/k8s-basic.html">
            
                    
                        <b>6.1.</b>
                    
                    k8s基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="../k8s/k8s-advanced.html">
            
                <a href="../k8s/k8s-advanced.html">
            
                    
                        <b>6.2.</b>
                    
                    k8s进阶
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">算法题</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="../leetcode/leetcode.html">
            
                <a href="../leetcode/leetcode.html">
            
                    
                        <b>7.1.</b>
                    
                    LeetCode
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Golang进阶</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="golang&#x9762;&#x8BD5;&#x9898;">Golang&#x9762;&#x8BD5;&#x9898;</h1>
<h1 id="1-&#x5E76;&#x53D1;&#x7BC7;">1. &#x5E76;&#x53D1;&#x7BC7;</h1>
<h2 id="11-&#x8FDB;&#x7A0B;&#x3001;&#x7EBF;&#x7A0B;&#x3001;&#x534F;&#x7A0B;&#x7684;&#x533A;&#x522B;">1.1. &#x8FDB;&#x7A0B;&#x3001;&#x7EBF;&#x7A0B;&#x3001;&#x534F;&#x7A0B;&#x7684;&#x533A;&#x522B;</h2>
<ul>
<li>&#x8FDB;&#x7A0B;</li>
</ul>
<p>&#x8FDB;&#x7A0B;&#x662F;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x5373;&#x8D44;&#x6E90;&#x9694;&#x79BB;&#x3002;&#x540C;&#x8FDB;&#x7A0B;&#x5185;&#x7684;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5171;&#x540C;&#x8BBF;&#x95EE;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x72EC;&#x7ACB;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4E0D;&#x540C;&#x8FDB;&#x7A0B;&#x901A;&#x8FC7;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x6765;&#x901A;&#x4FE1;&#x3002;&#x7531;&#x4E8E;&#x8FDB;&#x7A0B;&#x6BD4;&#x8F83;&#x91CD;&#x91CF;&#xFF0C;&#x5360;&#x636E;&#x72EC;&#x7ACB;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x4E0A;&#x4E0B;&#x6587;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x5207;&#x6362;&#x5F00;&#x9500;&#xFF08;&#x6808;&#x3001;&#x5BC4;&#x5B58;&#x5668;&#x3001;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x3001;&#x6587;&#x4EF6;&#x53E5;&#x67C4;&#x7B49;&#xFF09;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x4F46;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x5B89;&#x5168;&#x3002;</p>
<ul>
<li>&#x7EBF;&#x7A0B;</li>
</ul>
<p>&#x7EBF;&#x7A0B;&#x662F;&#x72EC;&#x7ACB;&#x8C03;&#x5EA6;&#x548C;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x7EBF;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x5F88;&#x5FEB;&#xFF0C;&#x8D44;&#x6E90;&#x5F00;&#x9500;&#x8F83;&#x5C11;&#xFF0C;&#x4F46;&#x76F8;&#x6BD4;&#x8FDB;&#x7A0B;&#x4E0D;&#x591F;&#x7A33;&#x5B9A;&#x5BB9;&#x6613;&#x4E22;&#x5931;&#x6570;&#x636E;&#x3002;</p>
<ul>
<li>&#x534F;&#x7A0B;</li>
</ul>
<p>&#x534F;&#x7A0B;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x6237;&#x6001;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;&#xFF0C;&#x534F;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x5B8C;&#x5168;&#x7531;&#x7528;&#x6237;&#x63A7;&#x5236;&#x3002;&#x534F;&#x7A0B;&#x6CA1;&#x6709;&#x7EBF;&#x7A0B;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x6D88;&#x8017;&#xFF0C;</p>
<h2 id="12-&#x5E76;&#x53D1;&#x548C;&#x5E76;&#x884C;&#x7684;&#x533A;&#x522B;">1.2. &#x5E76;&#x53D1;&#x548C;&#x5E76;&#x884C;&#x7684;&#x533A;&#x522B;</h2>
<ul>
<li><p>&#x5E76;&#x53D1;&#xFF08;<strong>Concurrent</strong>&#xFF09;&#xFF1A;&#x5E76;&#x5B58;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;CPU&#x540C;&#x65F6;&#x505A;&#x591A;&#x4EF6;&#x4E8B;&#xFF0C;&#x5B9E;&#x9645;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x5207;&#x6362;&#x65F6;&#x95F4;&#x7247;&#x53BB;&#x505A;&#x591A;&#x4EF6;&#x4E8B;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x540C;&#x65F6;&#x5728;&#x505A;&#x591A;&#x4EF6;&#x4E8B;&#x3002;&#x4F8B;&#x5982;&#xFF1A;CPU&#x5728;&#x65F6;&#x95F4;&#x7247;1&#x4E2D;&#x505A;&#x4EFB;&#x52A1;A&#xFF0C;&#x65F6;&#x95F4;&#x7247;2&#x4E2D;&#x505A;&#x4EFB;&#x52A1;B&#xFF0C;&#x65F6;&#x95F4;&#x7247;3&#x4E2D;&#x518D;&#x505A;&#x4EFB;&#x52A1;A&#xFF0C;&#x65F6;&#x95F4;&#x7247;4&#x4E2D;&#x518D;&#x505A;&#x4EFB;&#x52A1;B&#xFF0C;&#x4E0D;&#x65AD;&#x5728;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x5207;&#x6362;&#x6267;&#x884C;&#x3002;</p>
</li>
<li><p>&#x5E76;&#x884C;&#xFF08;<strong>Parallel</strong>&#xFF09;&#xFF1A;&#x5E73;&#x884C;&#x7684;&#xFF0C;&#x591A;&#x4E2A;CPU&#x540C;&#x65F6;&#x505A;&#x591A;&#x4EF6;&#x4E8B;&#xFF0C;CPU1&#x505A;&#x4EFB;&#x52A1;A&#xFF0C;CPU2&#x505A;&#x4EFB;&#x52A1;B&#xFF0C;&#x4E0D;&#x540C;CPU&#x505A;&#x4E0D;&#x540C;&#x65F6;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E92;&#x4E0D;&#x5E72;&#x6270;&#x3002;</p>
</li>
</ul>
<p>&#x5E76;&#x884C;&#x7531;&#x4E8E;&#x6709;&#x591A;&#x4E2A;CPU&#x5206;&#x522B;&#x505A;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x62A2;&#x5360;&#x8D44;&#x6E90;&#x3002;&#x5E76;&#x53D1;&#x662F;&#x7531;&#x4E00;&#x4E2A;CPU&#x505A;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x5B58;&#x5728;&#x62A2;&#x5360;&#x8D44;&#x6E90;&#xFF0C;&#x5207;&#x6362;&#x4EFB;&#x52A1;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<h1 id="2-&#x6982;&#x5FF5;&#x7BC7;">2. &#x6982;&#x5FF5;&#x7BC7;</h1>
<h2 id="21-defer">2.1. defer</h2>
<p><strong>defer</strong>&#xFF08;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#xFF1A;&#x63A8;&#x8FDF;&#xFF09;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x63A8;&#x8FDF;&#x6267;&#x884C;&#xFF0C;&#x5373;&#x5728;&#x51FD;&#x6570;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x5176;&#x4E2D;&#x51FD;&#x6570;&#x7ED3;&#x675F;&#x4E3B;&#x8981;&#x5305;&#x62EC;return&#x548C;panic&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5373;&#x6B63;&#x5E38;&#x7ED3;&#x675F;&#x548C;&#x5F02;&#x5E38;&#x7ED3;&#x675F;&#x3002;</p>
<ul>
<li><p>defer&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;</p>
<ul>
<li>defer&#x5728;&#x58F0;&#x660E;&#x65F6;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x63A8;&#x8FDF;&#x6267;&#x884C;&#xFF0C;&#x5728;return&#x524D;&#x6267;&#x884C;&#xFF0C;defer&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x662F;&#x5148;&#x8FDB;&#x540E;&#x51FA;&#xFF0C;&#x5012;&#x5E8F;&#x4F9D;&#x6B21;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7684;defer&#x8BED;&#x53E5;&#x3002;</li>
</ul>
</li>
<li><p>defer&#x7684;&#x7279;&#x6027;</p>
<ul>
<li>&#x5373;&#x4F7F;&#x51FD;&#x6570;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;defer&#x4ECD;&#x4F1A;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x5BFC;&#x81F4;&#x8D44;&#x6E90;&#x4E0D;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x6216;&#x8005;&#x56E0;&#x4E3A;&#x7B2C;&#x4E09;&#x65B9;&#x5305;&#x7684;&#x5F02;&#x5E38;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x3002;</li>
</ul>
</li>
<li><p>defer&#x7684;&#x4F5C;&#x7528;</p>
<ul>
<li>&#x7528;&#x6765;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#xFF08;&#x5173;&#x95ED;&#x6587;&#x4EF6;&#x7B49;&#xFF09;&#x3001;&#x6E05;&#x7406;&#x6570;&#x636E;&#x3001;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7B49;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x7BA1;&#x51FD;&#x6570;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x7ED3;&#x675F;&#xFF0C;&#x90FD;&#x4F1A;&#x5728;&#x7ED3;&#x675F;&#x524D;&#x9006;&#x5E8F;&#x6267;&#x884C;defer&#x8BED;&#x53E5;&#x3002;</li>
</ul>
</li>
</ul>
<h2 id="22-recover">2.2. recover</h2>
<p>&#xFF08;recover&#xFF09;&#x5185;&#x5EFA;&#x51FD;&#x6570;&#x88AB;&#x7528;&#x4E8E;&#x4ECE; panic &#x6216; &#x9519;&#x8BEF;&#x573A;&#x666F;&#x4E2D;&#x6062;&#x590D;&#xFF1A;&#x8BA9;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4ECE; panicking &#x91CD;&#x65B0;&#x83B7;&#x5F97;&#x63A7;&#x5236;&#x6743;&#xFF0C;&#x505C;&#x6B62;&#x7EC8;&#x6B62;&#x8FC7;&#x7A0B;&#x8FDB;&#x800C;&#x6062;&#x590D;&#x6B63;&#x5E38;&#x6267;&#x884C;&#x3002;<code>recover</code> &#x53EA;&#x80FD;&#x5728; defer &#x4FEE;&#x9970;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#x4F7F;&#x7528;&#xFF1A;&#x7528;&#x4E8E;&#x53D6;&#x5F97; panic &#x8C03;&#x7528;&#x4E2D;&#x4F20;&#x9012;&#x8FC7;&#x6765;&#x7684;&#x9519;&#x8BEF;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x6B63;&#x5E38;&#x6267;&#x884C;&#xFF0C;&#x8C03;&#x7528; <code>recover</code> &#x4F1A;&#x8FD4;&#x56DE; nil&#xFF0C;&#x4E14;&#x6CA1;&#x6709;&#x5176;&#x5B83;&#x6548;&#x679C;&#x3002;</p>
<h2 id="23-&#x95ED;&#x5305;">2.3. &#x95ED;&#x5305;</h2>
<p>&#x53C2;&#x8003;&#xFF1A; <a href="https://tour.golang.org/moretypes/25" target="_blank">A Tour of Go</a></p>
<p>&#x5E38;&#x7528;&#x5728;go&#x548C;defer&#x4E2D;&#x3002;</p>
<p>&#x95ED;&#x5305;&#x662F;&#x6307;&#x5F15;&#x7528;&#x4E86;&#x51FD;&#x6570;&#x5916;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x4E00;&#x79CD;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x8BE5;&#x51FD;&#x6570;&#x5C31;&#x88AB;&#x7ED1;&#x5B9A;&#x5728;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x4E0A;&#x3002;</p>
<p>&#x533F;&#x540D;&#x51FD;&#x6570;&#x540C;&#x6837;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;&#x95ED;&#x5305;&#xFF08;&#x51FD;&#x6570;&#x5F0F;&#x8BED;&#x8A00;&#x7684;&#x672F;&#x8BED;&#xFF09;&#xFF1A;&#x5B83;&#x4EEC;&#x88AB;&#x5141;&#x8BB8;&#x8C03;&#x7528;&#x5B9A;&#x4E49;&#x5728;&#x5176;&#x5B83;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x95ED;&#x5305;&#x53EF;&#x4F7F;&#x5F97;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x6355;&#x6349;&#x5230;&#x4E00;&#x4E9B;&#x5916;&#x90E8;&#x72B6;&#x6001;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x51FD;&#x6570;&#x88AB;&#x521B;&#x5EFA;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x4E3A;&#xFF1A;&#x4E00;&#x4E2A;&#x95ED;&#x5305;&#x7EE7;&#x627F;&#x4E86;&#x51FD;&#x6570;&#x6240;&#x58F0;&#x660E;&#x65F6;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#xFF08;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#x90FD;&#x88AB;&#x5171;&#x4EAB;&#x5230;&#x95ED;&#x5305;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x5728;&#x95ED;&#x5305;&#x4E2D;&#x88AB;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x5230;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;</p>
<p>&#x95ED;&#x5305;&#x662F;&#x5305;&#x542B;&#x81EA;&#x7531;&#x53D8;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x4E0D;&#x5728;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x5185;&#x6216;&#x8005;&#x4EFB;&#x4F55;&#x5168;&#x5C40;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x5B9A;&#x4E49;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x5B9A;&#x4E49;&#x3002;&#x7531;&#x4E8E;&#x81EA;&#x7531;&#x53D8;&#x91CF;&#x5305;&#x542B;&#x5728;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x8981;&#x95ED;&#x5305;&#x8FD8;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x81EA;&#x7531;&#x53D8;&#x91CF;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x5C31;&#x4E0D;&#x4F1A;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x8981;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x4E3A;&#x81EA;&#x7531;&#x53D8;&#x91CF;&#x63D0;&#x4F9B;&#x7ED1;&#x5B9A;&#x7684;&#x8BA1;&#x7B97;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x95ED;&#x5305;&#x7684;&#x4EF7;&#x503C;&#x5728;&#x4E8E;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x6216;&#x8005;&#x533F;&#x540D;&#x51FD;&#x6570;&#xFF0C;&#x5BF9;&#x4E8E;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x4EC5;&#x8981;&#x8868;&#x793A;&#x6570;&#x636E;&#x8FD8;&#x8981;&#x8868;&#x793A;&#x4EE3;&#x7801;&#x3002;&#x652F;&#x6301;&#x95ED;&#x5305;&#x7684;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x90FD;&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x7EA7;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x5230;&#x53D8;&#x91CF;&#x4E2D;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x80FD;&#x591F;&#x88AB;&#x51FD;&#x6570;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x548C;&#x8FD4;&#x56DE;&#x3002;</p>
<h3 id="231-golang-for-range&#x4E2D;&#x7684;&#x95ED;&#x5305;">2.3.1. golang for range&#x4E2D;&#x7684;&#x95ED;&#x5305;</h3>
<p><a href="https://golang.org/doc/faq#closures_and_goroutines" target="_blank">Frequently Asked Questions (FAQ) - The Go Programming Language</a></p>
<p><a href="https://github.com/golang/go/wiki/CommonMistakes" target="_blank">CommonMistakes &#xB7; golang/go Wiki &#xB7; GitHub</a></p>
<p>&#x5728;for range&#x4E2D;goroutine&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x95ED;&#x5305;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7ED9;&#x533F;&#x540D;&#x51FD;&#x6570;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x8FED;&#x4EE3;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;goroutine&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x4F1A;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x53D8;&#x91CF;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x8FED;&#x4EE3;&#x53D8;&#x91CF;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6765;&#x62F7;&#x8D1D;&#x8FED;&#x4EE3;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x95ED;&#x5305;&#x56E0;&#x4E3A;&#x7ED1;&#x5B9A;&#x4E86;&#x53D8;&#x91CF;&#xFF0C;&#x5F53;&#x6BCF;&#x4E2A;groutine&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x8FED;&#x4EE3;&#x53D8;&#x91CF;&#x53EF;&#x80FD;&#x88AB;&#x66F4;&#x6539;&#x3002;</p>
<pre class="language-"><code class="lang-go"><span class="token comment">// false, print 3 3 3</span>
values <span class="token operator">:=</span> <span class="token punctuation">[</span><span class="token punctuation">]</span><span class="token builtin">int</span><span class="token punctuation">{</span><span class="token number">1</span><span class="token punctuation">,</span><span class="token number">2</span><span class="token punctuation">,</span><span class="token number">3</span><span class="token punctuation">}</span>
<span class="token keyword">for</span> <span class="token boolean">_</span><span class="token punctuation">,</span> val <span class="token operator">:=</span> <span class="token keyword">range</span> values <span class="token punctuation">{</span>
    <span class="token keyword">go</span> <span class="token keyword">func</span><span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span>
        fmt<span class="token punctuation">.</span><span class="token function">Println</span><span class="token punctuation">(</span>val<span class="token punctuation">)</span>
    <span class="token punctuation">}</span><span class="token punctuation">(</span><span class="token punctuation">)</span>
<span class="token punctuation">}</span>
<span class="token comment">// true, print 1 2 3</span>
<span class="token keyword">for</span> <span class="token boolean">_</span><span class="token punctuation">,</span> val <span class="token operator">:=</span> <span class="token keyword">range</span> values <span class="token punctuation">{</span>
    <span class="token keyword">go</span> <span class="token keyword">func</span><span class="token punctuation">(</span>val <span class="token keyword">interface</span><span class="token punctuation">{</span><span class="token punctuation">}</span><span class="token punctuation">)</span> <span class="token punctuation">{</span>
        fmt<span class="token punctuation">.</span><span class="token function">Println</span><span class="token punctuation">(</span>val<span class="token punctuation">)</span>
    <span class="token punctuation">}</span><span class="token punctuation">(</span>val<span class="token punctuation">)</span>
<span class="token punctuation">}</span>
</code></pre>
<h1 id="3-&#x539F;&#x7406;&#x7BC7;">3. &#x539F;&#x7406;&#x7BC7;</h1>
<h2 id="31-goroutine&#x8C03;&#x5EA6;&#x6A21;&#x578B;">3.1. Goroutine&#x8C03;&#x5EA6;&#x6A21;&#x578B;</h2>
<h3 id="311-&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;go&#x7684;&#x8C03;&#x5EA6;&#x6A21;&#x578B;">3.1.1. &#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;go&#x7684;&#x8C03;&#x5EA6;&#x6A21;&#x578B;</h3>
<p>&#x53C2;&#x8003;&#xFF1A;<a href="http://morsmachine.dk/go-scheduler" target="_blank">The Go scheduler - Morsing&apos;s blog</a></p>
<ol>
<li>&#x9996;&#x5148;&#xFF0C;Goroutine&#x7684;&#x8C03;&#x5EA6;&#x662F;&#x901A;&#x8FC7;GPM&#x6A21;&#x578B;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5176;&#x4E2D;</li>
<li><p>G&#xFF1A;goroutine&#xFF0C;&#x4EE3;&#x8868;goroutine&#xFF0C;&#x5373;&#x6267;&#x884C;&#x7684;goroutine&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53CA;&#x6808;&#x7B49;&#x3002;&#xFF08;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x6BD4;&#x55BB;&#x6210;&#x7816;&#x5934;&#xFF09;</p>
</li>
<li><p>P&#xFF1A;processor&#xFF0C;&#x4EE3;&#x8868;&#x8C03;&#x5EA6;&#x6267;&#x884C;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;context&#xFF09;&#xFF0C;&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x7684;goroutine&#x7684;&#x961F;&#x5217;&#x3002;&#xFF08;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x6BD4;&#x55BB;&#x6210;&#x5C0F;&#x63A8;&#x8F66;&#xFF09;</p>
</li>
<li><p>M&#xFF1A;machine&#xFF0C;&#x4EE3;&#x8868;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x8FDB;&#x7A0B;&#xFF0C;&#x7528;&#x6765;&#x6267;&#x884C;G&#x3002;&#xFF08;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x6BD4;&#x55BB;&#x6210;&#x5DE5;&#x4EBA;&#xFF09;</p>
</li>
<li>&#x5176;&#x6B21;&#xFF0C;&#x8C03;&#x5EA6;&#x7684;&#x672C;&#x8D28;&#x662F;&#x5C06;G&#x5C3D;&#x91CF;&#x5747;&#x5300;&#x5408;&#x7406;&#x5730;&#x5B89;&#x7ED9;M&#x6765;&#x6267;&#x884C;&#xFF0C;&#x5176;&#x4E2D;P&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x6765;&#x5B9E;&#x73B0;&#x5408;&#x7406;&#x5B89;&#x6392;&#x903B;&#x8F91;&#x3002;</li>
<li><p>P&#x7684;&#x6570;&#x91CF;&#x901A;&#x8FC7; <code>GOMAXPROCS()</code> &#x6765;&#x8BBE;&#x7F6E;&#xFF0C;&#x4E00;&#x822C;&#x7B49;&#x4E8E;CPU&#x7684;&#x6838;&#x6570;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x6B21;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x8BBE;&#x7F6E;&#x597D;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x53D8;&#x3002;</p>
</li>
<li><p>P&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x7684;G&#x961F;&#x5217;&#xFF0C;&#x5305;&#x62EC;&#x6B63;&#x5728;&#x6267;&#x884C;&#x548C;&#x5F85;&#x6267;&#x884C;&#x7684;G&#xFF0C;&#x5C3D;&#x91CF;&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x7684;P&#x90FD;&#x5339;&#x914D;&#x4E00;&#x4E2A;M&#x540C;&#x65F6;&#x5728;&#x6267;&#x884C;G&#x3002;</p>
</li>
<li><p>P&#x548C;M&#x662F;&#x52A8;&#x6001;&#x5F62;&#x5F0F;&#x7684;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x5173;&#x7CFB;&#xFF0C;P&#x548C;G&#x662F;&#x52A8;&#x6001;&#x5F62;&#x5F0F;&#x7684;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
</li>
</ol>
<p>P&#x5B58;&#x5728;&#x7684;&#x539F;&#x56E0;&#xFF1A;</p>
<ol>
<li>&#x5F53;goroutine&#x53D1;&#x751F;&#x963B;&#x585E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;P&#x5C06;&#x5269;&#x4F59;&#x7684;G&#x5207;&#x6362;&#x7ED9;&#x65B0;&#x7684;M&#x6765;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x5269;&#x4F59;&#x7684;G&#x65E0;&#x6CD5;&#x6267;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;M&#x5219;&#x521B;&#x5EFA;M&#x6765;&#x5339;&#x914D;P&#x3002;</li>
<li>P&#x53EF;&#x4EE5;&#x5077;&#x4EFB;&#x52A1;&#x5373;goroutine&#xFF0C;&#x5F53;&#x67D0;&#x4E2A;P&#x7684;&#x672C;&#x5730;G&#x6267;&#x884C;&#x5B8C;&#xFF0C;&#x4E14;&#x5168;&#x5C40;&#x6CA1;&#x6709;G&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;P&#x53EF;&#x4EE5;&#x53BB;&#x5077;&#x522B;&#x7684;P&#x8FD8;&#x6CA1;&#x6709;&#x6267;&#x884C;&#x5B8C;&#x7684;&#x4E00;&#x534A;&#x7684;G&#x6765;&#x7ED9;M&#x6267;&#x884C;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;G&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x3002;</li>
</ol>
<h3 id="312-gpm&#x6A21;&#x578B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;p">3.1.2. GPM&#x6A21;&#x578B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;P?</h3>
<ul>
<li>&#x6CA1;&#x6709;P&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF1A;</li>
</ul>
<p>&#x65E9;&#x671F;Go&#x4E2D;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x76F4;&#x63A5;&#x5C06;G&#x5206;&#x914D;&#x5230;&#x5408;&#x9002;&#x7684;M&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x4F46;&#x8FD9;&#x6837;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x540C;&#x7684;G&#x5728;&#x4E0D;&#x540C;&#x7684;M&#x4E0A;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x80FD;&#x90FD;&#x9700;&#x5411;&#x7CFB;&#x7EDF;&#x7533;&#x8BF7;&#x8D44;&#x6E90;&#xFF08;&#x5982;&#x5806;&#x5185;&#x5B58;&#xFF09;&#xFF0C;&#x7531;&#x4E8E;&#x8D44;&#x6E90;&#x662F;&#x5168;&#x5C40;&#x7684;&#xFF0C;&#x5C06;&#x4F1A;&#x7531;&#x4E8E;&#x8D44;&#x6E90;&#x7ADE;&#x4E89;&#x9020;&#x6210;&#x5F88;&#x591A;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x635F;&#x8017;&#x3002;</p>
<ul>
<li>P&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;</li>
</ul>
<p>&#x540E;&#x9762;&#x7684;Go&#xFF08;Go1.1&#xFF09;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x52A0;&#x5165;&#x4E86;P&#xFF0C;&#x8BA9;P&#x53BB;&#x7BA1;&#x7406;G&#x5BF9;&#x8C61;&#xFF0C;M&#x8981;&#x60F3;&#x8FD0;&#x884C;G&#x5FC5;&#x987B;&#x5148;&#x4E0E;&#x4E00;&#x4E2A;P&#x7ED1;&#x5B9A;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x8FD0;&#x884C;&#x8BE5;P&#x7BA1;&#x7406;&#x7684;G&#x3002;&#x8FD9;&#x6837;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;P&#x5BF9;&#x8C61;&#x4E2D;&#x9884;&#x5148;&#x7533;&#x8BF7;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF08;&#x672C;&#x5730;&#x8D44;&#x6E90;&#xFF09;&#xFF0C;G&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x5148;&#x5411;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x5730;P&#x7533;&#x8BF7;&#xFF08;&#x65E0;&#x9700;&#x9501;&#x4FDD;&#x62A4;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x591F;&#x7528;&#x6216;&#x6CA1;&#x6709;&#x518D;&#x5411;&#x5168;&#x5C40;&#x7533;&#x8BF7;&#xFF0C;&#x800C;&#x4E14;&#x4ECE;&#x5168;&#x5C40;&#x62FF;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x591A;&#x62FF;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4EE5;&#x4F9B;&#x540E;&#x9762;&#x9AD8;&#x6548;&#x7684;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53BB;&#x653F;&#x5E9C;&#x529E;&#x4E8B;&#x60C5;&#x4E00;&#x6837;&#xFF0C;&#x5148;&#x53BB;&#x672C;&#x5730;&#x653F;&#x5E9C;&#x770B;&#x80FD;&#x641E;&#x5B9A;&#x4E0D;&#xFF0C;&#x5982;&#x679C;&#x641E;&#x4E0D;&#x5B9A;&#x518D;&#x53BB;&#x4E2D;&#x592E;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x4F9B;&#x529E;&#x4E8B;&#x6548;&#x7387;&#x3002; &#x800C;&#x4E14;&#x7531;&#x4E8E;P&#x89E3;&#x8026;&#x4E86;G&#x548C;M&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x6837;&#x5373;&#x4F7F;M&#x7531;&#x4E8E;&#x88AB;&#x5176;&#x4E0A;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;G&#x963B;&#x585E;&#x4F4F;&#xFF0C;&#x5176;&#x4F59;&#x4E0E;&#x8BE5;M&#x5173;&#x8054;&#x7684;G&#x4E5F;&#x53EF;&#x4EE5;&#x968F;&#x7740;P&#x4E00;&#x8D77;&#x8FC1;&#x79FB;&#x5230;&#x522B;&#x7684;&#x6D3B;&#x8DC3;&#x7684;M&#x4E0A;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;G&#x603B;&#x80FD;&#x53CA;&#x65F6;&#x627E;&#x5230;M&#x5E76;&#x8FD0;&#x884C;&#x81EA;&#x5DF1;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x7684;&#x5E76;&#x53D1;&#x80FD;&#x529B;&#x3002; </p>
<p>Go&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x901A;&#x8FC7;&#x6784;&#x9020;G-P-M&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x5957;&#x7528;&#x6237;&#x6001;&#x7684;&#x5E76;&#x53D1;&#x8C03;&#x5EA6;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x7BA1;&#x7406;&#x548C;&#x8C03;&#x5EA6;&#x81EA;&#x5DF1;&#x7684;&#x5E76;&#x53D1;&#x4EFB;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x8BF4;Go&#x8BED;&#x8A00;<strong>&#x539F;&#x751F;&#x652F;&#x6301;&#x5E76;&#x53D1;</strong>&#x3002;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x8D1F;&#x8D23;&#x5C06;&#x5E76;&#x53D1;&#x4EFB;&#x52A1;&#x5206;&#x914D;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x5185;&#x6838;&#x8C03;&#x5EA6;&#x5668;&#x63A5;&#x7BA1;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x5728;CPU&#x4E0A;&#x7684;&#x6267;&#x884C;&#x4E0E;&#x8C03;&#x5EA6;&#x3002;</p>
<h2 id="32-&#x5783;&#x573E;&#x56DE;&#x6536;">3.2. &#x5783;&#x573E;&#x56DE;&#x6536;</h2>
<h3 id="321-&#x4E09;&#x8272;&#x6807;&#x8BB0;&#x6CD5;">3.2.1. &#x4E09;&#x8272;&#x6807;&#x8BB0;&#x6CD5;</h3>
<p>go&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x662F;&#x901A;&#x8FC7;&#x4E09;&#x8272;&#x6807;&#x8BB0;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5176;&#x4E2D;</p>
<ul>
<li>&#x9ED1;&#x8272;&#xFF1A;&#x6CA1;&#x6709;&#x6307;&#x5411;&#xFF08;&#x5F15;&#x7528;&#xFF09;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;</li>
<li>&#x7070;&#x8272;&#xFF1A;&#x53EF;&#x80FD;&#x6307;&#x5411;&#xFF08;&#x5F15;&#x7528;&#xFF09;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x5BF9;&#x8C61;</li>
<li>&#x767D;&#x8272;&#xFF1A;&#x5269;&#x4E0B;&#x7684;&#x9700;&#x8981;&#x88AB;&#x56DE;&#x6536;&#x7684;&#x5019;&#x9009;&#x5BF9;&#x8C61;&#xFF0C;&#x5F53;&#x7070;&#x8272;&#x96C6;&#x5408;&#x4E3A;&#x7A7A;&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x6CA1;&#x6709;&#x88AB;&#x5F15;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x56DE;&#x6536;&#x3002;</li>
</ul>
<p>&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5FAA;&#x73AF;&#x7684;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li>&#x5C06;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x653E;&#x5165;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;</li>
<li>&#x626B;&#x63CF;&#x6240;&#x6709;roots&#x5BF9;&#x8C61;&#xFF0C;&#x653E;&#x5165;&#x7070;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#xFF0C;roots&#x5BF9;&#x8C61;&#x8868;&#x793A;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x53EF;&#x4EE5;&#x88AB;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5176;&#x4ED6;&#x5728;&#x6808;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x5C06;&#x7070;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x653E;&#x5165;&#x9ED1;&#x8272;&#x96C6;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x626B;&#x63CF;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x6709;&#x5F15;&#x5230;&#x5230;&#x7684;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x90A3;&#x4E9B;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x5F15;&#x7528;&#x5230;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x653E;&#x5165;&#x7070;&#x8272;&#x96C6;&#x5408;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x5C06;&#x7070;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x65AD;&#x653E;&#x5165;&#x9ED1;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x65AD;&#x653E;&#x5165;&#x7070;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x3002;</li>
<li>&#x5F53;&#x7070;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x4E3A;0&#xFF0C;&#x5373;&#x90FD;&#x88AB;&#x653E;&#x5165;&#x5230;&#x9ED1;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x4E86;&#xFF0C;&#x8868;&#x793A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x4F1A;&#x5F15;&#x7528;&#x5230;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x9ED1;&#x8272;&#x96C6;&#x5408;&#x5B58;&#x653E;&#x4E0D;&#x4F1A;&#x5F15;&#x7528;&#x767D;&#x8272;&#x96C6;&#x5408;&#x5BF9;&#x8C61;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x7070;&#x8272;&#x96C6;&#x5408;&#x4E3A;0&#xFF0C;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x5F15;&#x7528;&#x767D;&#x8272;&#x96C6;&#x5408;&#x5BF9;&#x8C61;&#x7684;&#x5143;&#x7D20;&#x3002;&#x6240;&#x4EE5;&#x767D;&#x8272;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x5373;&#x662F;&#x6CA1;&#x6709;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li>
</ol>
<h3 id="322-&#x4E09;&#x8272;&#x6807;&#x8BB0;&#x548C;&#x5199;&#x5C4F;&#x969C;">3.2.2. &#x4E09;&#x8272;&#x6807;&#x8BB0;&#x548C;&#x5199;&#x5C4F;&#x969C;</h3>
<p>&#x8FD9;&#x662F;&#x8BA9;&#x6807;&#x8BB0;&#x548C;&#x2F64;&#x6237;&#x4EE3;&#x7801;&#x5E76;&#x53D1;&#x7684;&#x57FA;&#x672C;&#x4FDD;&#x969C;&#xFF0C;&#x57FA;&#x672C;&#x539F;&#x7406;&#xFF1A;
&#x2022; &#x8D77;&#x521D;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x2F69;&#x2F8A;&#x3002;
&#x2022; &#x626B;&#x63CF;&#x627E;&#x51FA;&#x6240;&#x6709;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;&#x7070;&#x2F8A;&#xFF0C;&#x653E;&#x2F0A;&#x5F85;&#x5904;&#x7406;&#x961F;&#x5217;&#x3002;
&#x2022; &#x4ECE;&#x961F;&#x5217;&#x63D0;&#x53D6;&#x7070;&#x2F8A;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x5176;&#x5F15;&#x2F64;&#x5BF9;&#x8C61;&#x6807;&#x8BB0;&#x4E3A;&#x7070;&#x2F8A;&#x653E;&#x2F0A;&#x961F;&#x5217;&#xFF0C;&#x2F83;&#x2F9D;&#x6807;&#x8BB0;&#x4E3A;&#x2FCA;&#x2F8A;&#x3002;
&#x2022; &#x5199;&#x5C4F;&#x969C;&#x76D1;&#x89C6;&#x5BF9;&#x8C61;&#x5185;&#x5B58;&#x4FEE;&#x6539;&#xFF0C;&#x91CD;&#x65B0;&#x6807;&#x2F8A;&#x6216;&#x653E;&#x56DE;&#x961F;&#x5217;&#x3002;
&#x5F53;&#x5B8C;&#x6210;&#x5168;&#x90E8;&#x626B;&#x63CF;&#x548C;&#x6807;&#x8BB0;&#x2F2F;&#x4F5C;&#x540E;&#xFF0C;&#x5269;&#x4F59;&#x4E0D;&#x662F;&#x2F69;&#x2F8A;&#x5C31;&#x662F;&#x2FCA;&#x2F8A;&#xFF0C;&#x5206;&#x522B;&#x4EE3;&#x8868;&#x8981;&#x5F85;&#x56DE;&#x6536;&#x548C;&#x6D3B;&#x8DC3;&#x5BF9;&#x8C61;&#xFF0C;&#x6E05;&#x7406;&#x64CD;&#x4F5C;&#x53EA;&#x9700;&#x5C06;&#x2F69;&#x2F8A;&#x5BF9;&#x8C61;&#x5185;&#x5B58;&#x6536;&#x56DE;&#x5373;&#x53EF;&#x3002;</p>
<h3 id="323-&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x7B97;&#x6CD5;-mark-sweep">3.2.3. &#x6807;&#x8BB0;&#x6E05;&#x9664;&#x7B97;&#x6CD5; (Mark-Sweep)</h3>
<p>&#x6807;&#x8BB0;-&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x548C;&#x6E05;&#x9664;&#x9636;&#x6BB5;&#x3002;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x6807;&#x8BB0;&#x51FA;&#x6240;&#x6709;&#x9700;&#x8981;&#x88AB;&#x56DE;&#x6536;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6E05;&#x9664;&#x9636;&#x6BB5;&#x5C31;&#x662F;&#x56DE;&#x6536;&#x88AB;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x4F18;&#x70B9;&#x662F;&#x7B80;&#x5355;&#xFF0C;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x3002;
&#x7F3A;&#x70B9;&#x662F;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x788E;&#x7247;&#x592A;&#x591A;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x540E;&#x7EED;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x4E3A;&#x5927;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x65F6;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x800C;&#x63D0;&#x524D;&#x89E6;&#x53D1;&#x65B0;&#x7684;&#x4E00;&#x6B21;&#x5783;&#x573E;&#x6536;&#x96C6;&#x52A8;&#x4F5C;&#x3002;&#xFF08;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x5BF9;&#x4E0D;&#x540C;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x5BF9;&#x8C61;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7B97;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x788E;&#x7247;&#x591A;&#xFF0C;&#x5185;&#x5B58;&#x5BB9;&#x6613;&#x6EE1;&#xFF0C;gc&#x9891;&#x7387;&#x9AD8;&#xFF0C;&#x8017;&#x65F6;&#xFF09;</p>
<h2 id="33-&#x5185;&#x5B58;&#x5206;&#x914D;">3.3. &#x5185;&#x5B58;&#x5206;&#x914D;</h2>
<h3 id="331-&#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x7684;&#x95EE;&#x9898;">3.3.1. &#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x7684;&#x95EE;&#x9898;</h3>
<p>&#x5F53;&#x7ED9;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x8FDE;&#x7EED;&#x5730;&#x5740;&#x7684;&#x5185;&#x5B58;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x90E8;&#x5206;&#x53D8;&#x91CF;&#x5185;&#x5B58;&#x7684;&#x56DE;&#x6536;&#x5BFC;&#x81F4;&#x5728;&#x5206;&#x914D;&#x65B0;&#x7684;&#x5185;&#x5B58;&#x9700;&#x6C42;&#x65F6;&#x65E0;&#x6CD5;&#x5229;&#x7528;&#x88AB;&#x56DE;&#x6536;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x56E0;&#x6B64;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E0D;&#x5F53;&#xFF0C;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x7684;&#x788E;&#x7247;&#x3002;</p>
<h3 id="332&#x57FA;&#x672C;&#x7B56;&#x7565;&#xFF1A;">3.3.2.&#x57FA;&#x672C;&#x7B56;&#x7565;&#xFF1A;</h3>
<ol>
<li>&#x6BCF;&#x6B21;&#x4ECE;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7533;&#x8BF7;&#x2F00;&#x2F24;&#x5757;&#x5185;&#x5B58;&#xFF08;&#x2F50;&#x5982; 1MB&#xFF09;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x7CFB;&#x7EDF;&#x8C03;&#x2F64;&#x3002;</li>
<li>&#x5C06;&#x7533;&#x8BF7;&#x5230;&#x7684;&#x2F24;&#x5757;&#x5185;&#x5B58;&#x6309;&#x7167;&#x7279;&#x5B9A;&#x2F24;&#x2F29;&#x9884;&#x5148;&#x5207;&#x5206;&#x6210;&#x2F29;&#x5757;&#xFF0C;&#x6784;&#x6210;&#x94FE;&#x8868;&#x3002;</li>
<li>&#x4E3A;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x4ECE;&#x2F24;&#x2F29;&#x5408;&#x9002;&#x7684;&#x94FE;&#x8868;&#x63D0;&#x53D6;&#x2F00;&#x4E2A;&#x2F29;&#x5757;&#x5373;&#x53EF;&#x3002;</li>
<li>&#x56DE;&#x6536;&#x5BF9;&#x8C61;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x5C06;&#x8BE5;&#x2F29;&#x5757;&#x5185;&#x5B58;&#x91CD;&#x65B0;&#x5F52;&#x8FD8;&#x5230;&#x539F;&#x94FE;&#x8868;&#xFF0C;&#x4EE5;&#x4FBF;&#x590D;&#x2F64;&#x3002;</li>
<li>&#x5982;&#x95F2;&#x7F6E;&#x5185;&#x5B58;&#x8FC7;&#x591A;&#xFF0C;&#x5219;&#x5C1D;&#x8BD5;&#x5F52;&#x8FD8;&#x90E8;&#x5206;&#x5185;&#x5B58;&#x7ED9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x964D;&#x4F4E;&#x6574;&#x4F53;&#x5F00;&#x9500;</li>
</ol>
<h3 id="333&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x672C;&#x8D28;">3.3.3.&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x672C;&#x8D28;</h3>
<p>&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684; cache &#x5C42;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5B58;&#x7ED3;&#x6784;&#xFF1B;&#x5C06;&#x4ECE;&#x7CFB;&#x7EDF;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x4E00;&#x5757;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#x5206;&#x5272;&#x6210;&#x591A;&#x5C42;&#x6B21;&#x7684; cache&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x9501;&#x7684;&#x4F7F;&#x7528;&#x4EE5;&#x63D0;&#x9AD8;&#x5185;&#x5B58;&#x5206;&#x914D;&#x6548;&#x7387;&#xFF1B;&#x7533;&#x8BF7;&#x4E0D;&#x540C;&#x7C7B;&#x5927;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x5757;&#x6765;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x540C;&#x65F6;&#x52A0;&#x901F;&#x5185;&#x5B58;&#x91CA;&#x653E;&#x540E;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;</p>
<p>go&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x5C06;&#x5185;&#x5B58;&#x9875;&#x5206;&#x6210;67&#x4E2A;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x89C4;&#x683C;&#xFF08;size class&#xFF09;&#x7684;&#x5757;&#xFF0C;&#x6700;&#x5C0F;&#x4E3A;8KB&#xFF0C;&#x6700;&#x5927;&#x4E3A;32768KB&#x3002;</p>
<p>&#x5185;&#x5B58;&#x5757;&#x7684;&#x5206;&#x7C7B;&#xFF1A;</p>
<ul>
<li>span:&#x7531;&#x591A;&#x4E2A;&#x5730;&#x5740;&#x8FDE;&#x7EED;&#x7684;&#x9875;&#xFF08;page&#xFF09;&#x7EC4;&#x6210;&#x7684;&#x5927;&#x5757;&#x5185;&#x5B58;&#x3002;&#x9762;&#x5411;&#x5185;&#x90E8;&#x7BA1;&#x7406;&#x3002;</li>
<li>object&#xFF1A;&#x5C06;span&#x6309;&#x7167;&#x7279;&#x5B9A;&#x7684;&#x5927;&#x5C0F;&#x5207;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x5C0F;&#x5757;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C0F;&#x5757;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x3002;</li>
</ul>
<p>&#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x7684;&#x4E09;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x7533;&#x8BF7;&#x9010;&#x7EA7;&#x5411;&#x4E0A;&#xFF09;&#xFF1A;</p>
<ul>
<li>mcache&#xFF1A;goroutine cache&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F; &#x672C;&#x5730; cache&#x3002;&#x4E0D;&#x6D89;&#x53CA;&#x9501;&#x7ADE;&#x4E89;&#x3002;</li>
<li>mcentral&#xFF1A;&#x5168;&#x5C40;cache&#xFF0C;mcache &#x4E0D;&#x591F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5411; mcentral &#x7533;&#x8BF7;&#x3002;&#x6D89;&#x53CA;&#x9501;&#x7ADE;&#x4E89;&#x3002;</li>
<li>mheap&#xFF1A;&#x5F53;mcentral &#x4E5F;&#x4E0D;&#x591F;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x8FC7; mheap &#x5411;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7533;&#x8BF7;&#x3002;</li>
</ul>
<h3 id="334&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x6D41;&#x7A0B;">3.3.4.&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x6D41;&#x7A0B;</h3>
<ol>
<li>object size &lt; 16K&#xFF0C;&#x4F7F;&#x7528; mcache &#x7684;&#x5C0F;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x5668; tiny &#x76F4;&#x63A5;&#x5206;&#x914D;&#x3002;</li>
<li>object size &gt; 32K&#xFF0C;&#x5219;&#x4F7F;&#x7528; mheap &#x76F4;&#x63A5;&#x5206;&#x914D;&#x3002;</li>
<li>object size &gt; 16K &amp;&amp; object size &lt; 32K&#xFF0C;&#x5148;&#x4F7F;&#x7528; mcache &#x4E2D;&#x5BF9;&#x5E94;&#x7684; size class &#x5206;&#x914D;&#x3002;</li>
<li>&#x5982;&#x679C; mcache &#x5BF9;&#x5E94;&#x7684; size class &#x7684; span &#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7684;&#x5757;&#xFF0C;&#x5219;&#x5411; mcentral &#x8BF7;&#x6C42;&#x3002;</li>
<li>&#x5982;&#x679C; mcentral &#x4E5F;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7684;&#x5757;&#xFF0C;&#x5219;&#x5411; mheap&#x7533;&#x8BF7;&#xFF0C;&#x5E76;&#x5207;&#x5206;&#x3002;</li>
<li>&#x5982;&#x679C; mheap &#x4E5F;&#x6CA1;&#x6709;&#x5408;&#x9002;&#x7684; span&#xFF0C;&#x5219;&#x60F3;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7533;&#x8BF7;&#x3002;</li>
</ol>
<h3 id="335&#x5185;&#x5B58;&#x56DE;&#x6536;&#x7684;&#x6D41;&#x7A0B;">3.3.5.&#x5185;&#x5B58;&#x56DE;&#x6536;&#x7684;&#x6D41;&#x7A0B;</h3>
<ul>
<li>mcache &#x5F52;&#x8FD8;&#x5185;&#x5B58;&#x5206;&#x4E24;&#x90E8;&#x5206;&#xFF1A;&#x5F52;&#x8FD8;mcentral&#x5185;&#x5B58;&#xFF0C;&#x53EF;&#x80FD;&#x6D89;&#x53CA;&#x9501;&#x7ADE;&#x4E89;&#xFF1B;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5F52;&#x8FD8;&#x5230;mheap&#xFF0C;&#x76F4;&#x63A5;&#x63D2;&#x5165;&#x94FE;&#x8868;&#x5934;&#x3002;</li>
<li>mcentral &#x5F52;&#x8FD8;mheap&#x3002;</li>
<li>mheap &#x5B9A;&#x65F6;&#x5F52;&#x8FD8;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x3002;</li>
</ul>
<h2 id="336tcmallocthread-caching-mallo">3.3.6.tcmalloc(thread-caching mallo)</h2>
<p>&#x662F;google&#x63A8;&#x51FA;&#x7684;&#x4E00;&#x79CD;&#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x7B56;&#x7565;&#xFF1A;&#x5168;&#x5C40;&#x7F13;&#x5B58;&#x5806;&#x548C;&#x8FDB;&#x7A0B;&#x7684;&#x79C1;&#x6709;&#x7F13;&#x5B58;&#x3002;</p>
<p>1.&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5C0F;&#x5BB9;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x7533;&#x8BF7;&#x8BD5;&#x7528;&#x8FDB;&#x7A0B;&#x7684;&#x79C1;&#x6709;&#x7F13;&#x5B58;&#xFF0C;&#x79C1;&#x6709;&#x7F13;&#x5B58;&#x4E0D;&#x8DB3;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x518D;&#x4ECE;&#x5168;&#x5C40;&#x7F13;&#x5B58;&#x7533;&#x8BF7;&#x4E00;&#x90E8;&#x5206;&#x4F5C;&#x4E3A;&#x79C1;&#x6709;&#x7F13;&#x5B58;&#x3002;</p>
<p>2.&#x5BF9;&#x4E8E;&#x5927;&#x5BB9;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x7533;&#x8BF7;&#x5219;&#x9700;&#x8981;&#x4ECE;&#x5168;&#x5C40;&#x7F13;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#x7533;&#x8BF7;&#x3002;&#x800C;&#x5927;&#x5C0F;&#x5BB9;&#x91CF;&#x7684;&#x8FB9;&#x754C;&#x5C31;&#x662F;32k&#x3002;&#x7F13;&#x5B58;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x94FE;&#x8868;&#x6570;&#x7EC4;&#xFF0C;&#x6570;&#x7EC4;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x94FE;&#x8868;&#xFF0C;&#x94FE;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>golang&#x8BED;&#x8A00;&#x4E2D;MHeap&#x5C31;&#x662F;&#x5168;&#x5C40;&#x7F13;&#x5B58;&#x5806;&#xFF0C;MCache&#x4F5C;&#x4E3A;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7F13;&#x5B58;&#x3002;</p>
<p>&#x5185;&#x5B58;&#x6C60;&#x5C31;&#x662F;&#x5229;&#x7528;MHeap&#x5B9E;&#x73B0;&#xFF0C;&#x5927;&#x5C0F;&#x5207;&#x5206;&#x5219;&#x662F;&#x5728;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x505A;&#x4E86;&#xFF0C;&#x540C;&#x65F6;MCache&#x5206;&#x914D;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;MCentral&#x53BB;&#x53D6;&#x5BF9;&#x5E94;&#x7684;sizeClass&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x7BA1;&#x7406;&#x65B9;&#x9762;&#x5219;&#x662F;&#x901A;&#x8FC7;MCache&#x53BB;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x603B;&#x7ED3;:</p>
<p>1.MHeap&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x8D1F;&#x8D23;&#x5411;&#x7CFB;&#x7EDF;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#xFF0C;mallocinit()&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;&#x5982;&#x679C;&#x5206;&#x914D;&#x5185;&#x5B58;&#x5BF9;&#x8C61;&#x5927;&#x4E8E;32K&#x76F4;&#x63A5;&#x5411;MHeap&#x7533;&#x8BF7;&#x3002;</p>
<p>2.MCache&#x7EBF;&#x7A0B;&#x7EA7;&#x522B;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x6C60;&#xFF0C;&#x5173;&#x8054;&#x7ED3;&#x6784;&#x4F53;P&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x8D1F;&#x8D23;&#x7EBF;&#x7A0B;&#x5185;&#x90E8;&#x5185;&#x5B58;&#x7533;&#x8BF7;&#x3002;</p>
<p>3.MCentral&#x8FDE;&#x63A5;MHeap&#x4E0E;MCache&#x7684;&#xFF0C;MCache&#x5185;&#x5B58;&#x4E0D;&#x591F;&#x5219;&#x5411;MCentral&#x7533;&#x8BF7;&#xFF0C;MCentral&#x4E0D;&#x591F;&#x65F6;&#x5411;MHeap&#x7533;&#x8BF7;&#x5185;&#x5B58;&#x3002;</p>
<h2 id="34-channel&#x7684;&#x539F;&#x7406;">3.4. channel&#x7684;&#x539F;&#x7406;</h2>
<p>channel&#x7684;&#x4F5C;&#x7528;&#x662F;&#x89E3;&#x51B3;goroutine&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8981;&#x901A;&#x8FC7;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x6765;&#x901A;&#x4FE1;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x901A;&#x4FE1;&#x6765;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x3002;</p>
<h3 id="341-channel&#x7684;&#x7279;&#x6027;">3.4.1. channel&#x7684;&#x7279;&#x6027;</h3>
<ul>
<li>goroutine&#x5B89;&#x5168;</li>
<li>&#x63D0;&#x4F9B;FIFO&#x8BED;&#x4E49;(buffered channel&#x63D0;&#x4F9B;)&#xFF0C;&#x7F13;&#x51B2;&#x5927;&#x5C0F;</li>
<li>&#x5728;&#x4E0D;&#x540C;&#x7684;goroutine&#x4E4B;&#x95F4;&#x5B58;&#x50A8;&#x548C;&#x4F20;&#x8F93;&#x503C;</li>
<li>&#x53EF;&#x4EE5;&#x8BA9;goroutine block/unblock</li>
</ul>
<h3 id="342-channel&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;">3.4.2. channel&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;</h3>
<pre class="language-"><code class="lang-go"><span class="token keyword">type</span> hchan <span class="token keyword">struct</span> <span class="token punctuation">{</span>
    qcount   <span class="token builtin">uint</span>           <span class="token comment">// &#x5F53;&#x524D;&#x961F;&#x5217;&#x4E2D;&#x5269;&#x4F59;&#x5143;&#x7D20;&#x4E2A;&#x6570;</span>
    dataqsiz <span class="token builtin">uint</span>           <span class="token comment">// &#x73AF;&#x5F62;&#x961F;&#x5217;&#x957F;&#x5EA6;&#xFF0C;&#x5373;&#x53EF;&#x4EE5;&#x5B58;&#x653E;&#x7684;&#x5143;&#x7D20;&#x4E2A;&#x6570;</span>
    buf      unsafe<span class="token punctuation">.</span>Pointer <span class="token comment">// &#x73AF;&#x5F62;&#x961F;&#x5217;&#x6307;&#x9488;</span>
    elemsize <span class="token builtin">uint16</span>         <span class="token comment">// &#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;</span>
    closed   <span class="token builtin">uint32</span>            <span class="token comment">// &#x6807;&#x8BC6;&#x5173;&#x95ED;&#x72B6;&#x6001;</span>
    elemtype <span class="token operator">*</span>_type         <span class="token comment">// &#x5143;&#x7D20;&#x7C7B;&#x578B;</span>
    sendx    <span class="token builtin">uint</span>           <span class="token comment">// &#x961F;&#x5217;&#x4E0B;&#x6807;&#xFF0C;&#x6307;&#x793A;&#x5143;&#x7D20;&#x5199;&#x5165;&#x65F6;&#x5B58;&#x653E;&#x5230;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;</span>
    recvx    <span class="token builtin">uint</span>           <span class="token comment">// &#x961F;&#x5217;&#x4E0B;&#x6807;&#xFF0C;&#x6307;&#x793A;&#x5143;&#x7D20;&#x4ECE;&#x961F;&#x5217;&#x7684;&#x8BE5;&#x4F4D;&#x7F6E;&#x8BFB;&#x51FA;</span>
    recvq    waitq          <span class="token comment">// &#x7B49;&#x5F85;&#x8BFB;&#x6D88;&#x606F;&#x7684;goroutine&#x961F;&#x5217;</span>
    sendq    waitq          <span class="token comment">// &#x7B49;&#x5F85;&#x5199;&#x6D88;&#x606F;&#x7684;goroutine&#x961F;&#x5217;</span>
    lock mutex              <span class="token comment">// &#x4E92;&#x65A5;&#x9501;&#xFF0C;chan&#x4E0D;&#x5141;&#x8BB8;&#x5E76;&#x53D1;&#x8BFB;&#x5199;</span>
<span class="token punctuation">}</span>
</code></pre>
<p>hchan&#x7EF4;&#x62A4;&#x4E86;&#x4E24;&#x4E2A;&#x94FE;&#x8868;&#xFF0C;recvq&#x662F;&#x56E0;&#x8BFB;&#x8FD9;&#x4E2A;chan&#x800C;&#x963B;&#x585E;&#x7684;G&#xFF0C;sendq&#x5219;&#x662F;&#x56E0;&#x5199;&#x8FD9;&#x4E2A;chan&#x800C;&#x963B;&#x585E;&#x7684;G&#x3002;waitq&#x961F;&#x5217;&#x4E2D;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E3A;sudog&#xFF0C;&#x5176;&#x4E2D;elem&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#x3002;</p>
<h3 id="343-&#x521B;&#x5EFA;channel">3.4.3. &#x521B;&#x5EFA;channel</h3>
<p>make&#x51FD;&#x6570;&#x5728;&#x521B;&#x5EFA;channel&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5728;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;heap&#x533A;&#x7533;&#x8BF7;&#x4E00;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;hchan&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x8FD4;&#x56DE;&#x6267;&#x884C;&#x8BE5;&#x5185;&#x5B58;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x6240;&#x4EE5;&#x83B7;&#x53D6;&#x7684;&#x7684;ch&#x53D8;&#x91CF;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x7684;&#x65F6;&#x5019;&#x662F;&#x540C;&#x4E00;&#x4E2A;channel&#x3002;</p>
<p>hchan&#x7ED3;&#x6784;&#x4F53;&#x4F7F;<strong>&#x7528;&#x4E00;&#x4E2A;&#x73AF;&#x5F62;&#x961F;&#x5217;</strong>&#x6765;&#x4FDD;&#x5B58;groutine&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x7684;&#x6570;&#x636E;(&#x5982;&#x679C;&#x662F;&#x7F13;&#x5B58;channel&#x7684;&#x8BDD;)&#xFF0C;&#x4F7F;&#x7528;<strong>&#x4E24;&#x4E2A;list</strong>&#x4FDD;&#x5B58;&#x50CF;&#x8BE5;chan&#x53D1;&#x9001;&#x548C;&#x4ECE;&#x6539;chan&#x63A5;&#x6536;&#x6570;&#x636E;&#x7684;goroutine&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;mutex&#x6765;&#x4FDD;&#x8BC1;&#x64CD;&#x4F5C;&#x8FD9;&#x4E9B;&#x7ED3;&#x6784;&#x7684;&#x5B89;&#x5168;&#x3002;</p>
<h3 id="344-&#x5199;&#x5165;channel">3.4.4. &#x5199;&#x5165;channel</h3>
<p>recvq&#x5B58;&#x653E;&#x8BFB;&#x53D6;channel&#x963B;&#x585E;&#x7684;G&#xFF0C;&#x6B64;&#x65F6;&#x8BF4;&#x660E;channel&#x91CC;&#x9762;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x3002;sendq&#x5B58;&#x653E;&#x5199;&#x5165;channel&#x963B;&#x585E;&#x7684;G&#xFF0C;&#x6B64;&#x65F6;&#x8BF4;&#x660E;channel&#x5DF2;&#x7ECF;&#x6EE1;&#x4E86;&#x3002;</p>
<ol>
<li>&#x5982;&#x679C;&#x7B49;&#x5F85;&#x63A5;&#x6536;&#x961F;&#x5217;recvq&#x4E0D;&#x4E3A;&#x7A7A;&#xFF0C;&#x8BF4;&#x660E;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x6B64;&#x65F6;&#x76F4;&#x63A5;&#x4ECE;recvq&#x53D6;&#x51FA;G,&#x5E76;&#x628A;&#x6570;&#x636E;&#x5199;&#x5165;&#xFF0C;&#x6700;&#x540E;&#x628A;&#x8BE5;recvq&#x7684;G&#x5524;&#x9192;&#xFF0C;&#x7ED3;&#x675F;&#x53D1;&#x9001;&#x8FC7;&#x7A0B;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x6709;&#x7A7A;&#x4F59;&#x4F4D;&#x7F6E;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x7ED3;&#x675F;&#x53D1;&#x9001;&#x8FC7;&#x7A0B;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x7F13;&#x51B2;&#x533A;&#x6EE1;&#x4E86;&#xFF0C;&#x5C06;&#x5F85;&#x53D1;&#x9001;&#x6570;&#x636E;&#x5199;&#x5165;G&#xFF0C;&#x5C06;&#x5F53;&#x524D;G&#x52A0;&#x5165;sendq&#xFF0C;&#x8FDB;&#x5165;&#x7761;&#x7720;&#xFF08;&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF09;&#xFF0C;&#x7B49;&#x5F85;&#x88AB;&#x8BFB;goroutine&#x5524;&#x9192;&#xFF1B;</li>
</ol>
<h3 id="345-&#x8BFB;&#x51FA;channel">3.4.5. &#x8BFB;&#x51FA;channel</h3>
<ol>
<li>&#x5982;&#x679C;&#x7B49;&#x5F85;&#x53D1;&#x9001;&#x961F;&#x5217;sendq&#x4E0D;&#x4E3A;&#x7A7A;&#xFF0C;&#x4E14;&#x6CA1;&#x6709;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x76F4;&#x63A5;&#x4ECE;sendq&#x4E2D;&#x53D6;&#x51FA;G&#xFF0C;&#x628A;G&#x4E2D;&#x6570;&#x636E;&#x8BFB;&#x51FA;&#xFF0C;&#x6700;&#x540E;&#x628A;G&#x5524;&#x9192;&#xFF0C;&#x7ED3;&#x675F;&#x8BFB;&#x53D6;&#x8FC7;&#x7A0B;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x7B49;&#x5F85;&#x53D1;&#x9001;&#x961F;&#x5217;sendq&#x4E0D;&#x4E3A;&#x7A7A;&#xFF0C;&#x6B64;&#x65F6;&#x8BF4;&#x660E;&#x7F13;&#x51B2;&#x533A;&#x5DF2;&#x6EE1;&#xFF0C;&#x4ECE;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x9996;&#x90E8;&#x8BFB;&#x51FA;&#x6570;&#x636E;&#xFF0C;&#x628A;G&#x4E2D;&#x6570;&#x636E;&#x5199;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x5C3E;&#x90E8;&#xFF0C;&#x628A;G&#x5524;&#x9192;&#xFF0C;&#x7ED3;&#x675F;&#x8BFB;&#x53D6;&#x8FC7;&#x7A0B;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x7B49;&#x5F85;&#x53D1;&#x9001;&#x961F;&#x5217;sendq&#x4E3A;&#x7A7A;&#xFF0C;&#x8BF4;&#x660E;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x4ECE;&#x7F13;&#x51B2;&#x533A;&#x53D6;&#x51FA;&#x6570;&#x636E;&#xFF0C;&#x7ED3;&#x675F;&#x8BFB;&#x53D6;&#x8FC7;&#x7A0B;&#xFF1B;</li>
<li>&#x5982;&#x679C;channel&#x8BFB;&#x53D6;&#x4E0D;&#x5230;&#x6570;&#x636E;&#xFF0C;&#x5C06;&#x5F53;&#x524D;goroutine&#x52A0;&#x5165;recvq&#xFF0C;&#x8FDB;&#x5165;&#x7761;&#x7720;&#xFF08;&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF09;&#xFF0C;&#x7B49;&#x5F85;&#x88AB;&#x5199;goroutine&#x5524;&#x9192;&#xFF1B;</li>
</ol>
<h3 id="346-&#x5173;&#x95ED;channel">3.4.6. &#x5173;&#x95ED;channel</h3>
<ul>
<li><p>&#x5C06; c.closed &#x8BBE;&#x7F6E;&#x4E3A; 1</p>
</li>
<li><p>&#x5524;&#x9192; recvq &#x961F;&#x5217;&#x91CC;&#x9762;&#x7684;&#x963B;&#x585E; goroutine</p>
</li>
<li><p>&#x5524;&#x9192; sendq &#x961F;&#x5217;&#x91CC;&#x9762;&#x7684;&#x963B;&#x585E; goroutine</p>
</li>
</ul>
<h3 id="347-&#x963B;&#x585E;">3.4.7. &#x963B;&#x585E;</h3>
<p>&#x5F53;G1&#x5411;buf&#x5DF2;&#x7ECF;&#x6EE1;&#x4E86;&#x7684;ch&#x53D1;&#x9001;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;runtine&#x68C0;&#x6D4B;&#x5230;&#x5BF9;&#x5E94;&#x7684;hchan&#x7684;buf&#x5DF2;&#x7ECF;&#x6EE1;&#x4E86;&#xFF0C;&#x4F1A;&#x901A;&#x77E5;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x4F1A;&#x5C06;G1&#x7684;&#x72B6;&#x6001;&#x8BBE;&#x7F6E;&#x4E3A;waiting, &#x79FB;&#x9664;&#x4E0E;&#x7EBF;&#x7A0B;M&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x7136;&#x540E;&#x4ECE;P&#x7684;runqueue&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;goroutine&#x5728;&#x7EBF;&#x7A0B;M&#x4E2D;&#x6267;&#x884C;&#xFF0C;&#x6B64;&#x65F6;G1&#x5C31;&#x662F;&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EA;&#x7528;&#x6D88;&#x8017;&#x5C11;&#x91CF;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<h3 id="348-&#x5524;&#x9192;">3.4.8. &#x5524;&#x9192;</h3>
<p>&#x5F53;G1&#x53D8;&#x4E3A;waiting&#x72B6;&#x6001;&#x540E;&#xFF0C;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x81EA;&#x5DF1;&#x7684;sudog&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x5230;sendq&#x8FD9;&#x4E2A;list&#x4E2D;&#xFF0C;sudog&#x7ED3;&#x6784;&#x4E2D;&#x4FDD;&#x5B58;&#x4E86;channel&#x76F8;&#x5173;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x6307;&#x9488;&#x3002;&#x5F53;G2&#x4ECE;ch&#x4E2D;&#x63A5;&#x6536;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4F1A;&#x901A;&#x77E5;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x8BBE;&#x7F6E;G1&#x7684;&#x72B6;&#x6001;&#x4E3A;runnable&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x52A0;&#x5165;P&#x7684;runqueue&#x91CC;&#xFF0C;&#x7B49;&#x5F85;&#x7EBF;&#x7A0B;&#x6267;&#x884C;.</p>
<h2 id="4-&#x6E90;&#x7801;&#x7BC7;">4. &#x6E90;&#x7801;&#x7BC7;</h2>
<h2 id="41-&#x5207;&#x7247;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;">4.1. &#x5207;&#x7247;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;</h2>
<h2 id="42-map&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;">4.2. map&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;</h2>
<h2 id="43-channel&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF1F;">4.3. channel&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF1F;</h2>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; www.huweihuang.com all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">Updated at 
2025-07-08 20:55:40
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="golang-basic.html" class="navigation navigation-prev " aria-label="Previous page: Golang基础">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../k8s/k8s-basic.html" class="navigation navigation-next " aria-label="Next page: k8s基础">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Golang进阶","level":"5.2","depth":1,"next":{"title":"k8s基础","level":"6.1","depth":1,"path":"k8s/k8s-basic.md","ref":"k8s/k8s-basic.md","articles":[]},"previous":{"title":"Golang基础","level":"5.1","depth":1,"path":"golang/golang-basic.md","ref":"golang/golang-basic.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","image-captions","editlink","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-huweihuang","-highlight","prism","prism-themes","sitemap-general","ga","donate","expandable-chapters"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © www.huweihuang.com","modify_label":"Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prismjs/themes/prism-okaidia.css"]},"theme-huweihuang":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"googleAdsenseClient":"ca-pub-8205636531078391"},"github":{"url":"https://github.com/huweihuang"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/huweihuang/interview-notes/blob/master/"},"splitter":{},"readmore":{"allowDomain":["www.huweihuang.com","localhost"],"blogId":"30679-1666624938200-328","name":"容器云架构","qrcode":"https://res.cloudinary.com/dqxtn0ick/image/upload/v1551600382/blog/wechat-public-acconut.jpg","keyword":"k8s"},"donate":{"alipay":"https://res.cloudinary.com/dqxtn0ick/image/upload/v1551599640/blog/donate/alipay.jpg","alipayText":"支付宝打赏","button":"赏","title":"","wechat":"https://res.cloudinary.com/dqxtn0ick/image/upload/v1551599472/blog/donate/wechatpay.jpg","wechatText":"微信打赏"},"codesnippet":{},"sitemap-general":{"prefix":"https://www.huweihuang.com/interview-notes/"},"fontsettings":{"theme":"white","family":"sans","size":2},"anchor-navigation-ex":{"showLevelIcon":false,"showLevel":false,"tocLevel1Icon":"fa fa-hand-o-right","tocLevel2Icon":"fa fa-hand-o-right","tocLevel3Icon":"fa fa-hand-o-right","multipleH1":false,"multipleH2":false,"multipleH3":false,"multipleH4":false},"favicon":{"shortcut":"images/favicon.ico","bookmark":"images/favicon.ico","appleTouch":"images/favicon.ico","appleTouchMore":{"120x120":"images/favicon.ico","180x180":"images/favicon.ico"}},"prism-themes":{},"github-buttons":{"repo":"huweihuang/interview-notes","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"e146d71b77957235bba1e709d930f62e"},"ga":{"configuration":"auto","token":"UA-114718458-2"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"expandable-chapters":{},"search-plus":{},"image-captions":{"caption":"图片 - _CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"胡伟煌","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[]},"title":"面试笔记","language":"zh-hans","links":{"sidebar":{"胡伟煌的博客":"https://www.huweihuang.com"}},"gitbook":"*","description":"面试笔记"},"file":{"path":"golang/golang-advanced.md","mtime":"2025-07-08T12:55:40.072Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2025-07-09T05:47:17.508Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

